# CannotAcquireCoordinatesFromScaledLink Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SharedCoordinatesFailures..::..CannotAcquireCoordinatesFromScaledLink Property
BuiltInFailures..::..SharedCoordinatesFailures Class See Also
---
Can't acquire coordinates from a link that is scaled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotAcquireCoordinatesFromScaledLink { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotAcquireCoordinatesFromScaledLink As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotAcquireCoordinatesFromScaledLink {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SharedCoordinatesFailures Class
Autodesk.Revit.DB Namespace